Revit 2027 API
SubMenuItem Properties
The SubMenuItem type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MenuItem)
Top
See Also
Reference
SubMenuItem Class
Autodesk.Revit.UI Namespace